loadtest-baseline-notification.txt
Running 20s test @ http://localhost:8080/notifications
50 connections with 10 pipelining factor


┌─────────┬───────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼───────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 22 ms │ 126 ms │ 284 ms │ 332 ms │ 124.22 ms │ 70.73 ms │ 609 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬──────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev    │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼──────────┼─────────┤
│ Req/Sec   │ 7,043   │ 7,043   │ 10,911  │ 14,039  │ 11,038.4 │ 2,145.62 │ 7,040   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼──────────┼─────────┤
│ Bytes/Sec │ 2.21 MB │ 2.21 MB │ 3.43 MB │ 4.41 MB │ 3.47 MB  │ 673 kB   │ 2.21 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴──────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

0 2xx responses, 220750 non 2xx responses
223k requests in 20.65s, 69.3 MB read