loadtest-baseline-payment.txt
Running 20s test @ http://localhost:8080/payments
50 connections with 10 pipelining factor


┌─────────┬───────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼───────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 22 ms │ 112 ms │ 285 ms │ 328 ms │ 120.37 ms │ 71.23 ms │ 500 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 10,911  │ 10,911  │ 12,999  │ 14,631 │ 13,050.4 │ 1,040  │ 10,905  │
├───────────┼─────────┼─────────┼─────────┼────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 3.42 MB │ 3.42 MB │ 4.08 MB │ 4.6 MB │ 4.1 MB   │ 327 kB │ 3.42 MB │
└───────────┴─────────┴─────────┴─────────┴────────┴──────────┴────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

0 2xx responses, 260989 non 2xx responses
264k requests in 20.27s, 81.9 MB read