loadtest-baseline.txt
Running 20s test @ http://localhost:8080/payments
50 connections with 10 pipelining factor


┌─────────┬────────┬────────┬────────┬────────┬──────────┬──────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max     │
├─────────┼────────┼────────┼────────┼────────┼──────────┼──────────┼─────────┤
│ Latency │ 103 ms │ 179 ms │ 417 ms │ 483 ms │ 199.3 ms │ 81.26 ms │ 1135 ms │
└─────────┴────────┴────────┴────────┴────────┴──────────┴──────────┴─────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬─────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Req/Sec   │ 957    │ 957    │ 2,691   │ 3,573   │ 2,554.9 │ 653    │ 957    │
├───────────┼────────┼────────┼─────────┼─────────┼─────────┼────────┼────────┤
│ Bytes/Sec │ 400 kB │ 400 kB │ 1.13 MB │ 1.49 MB │ 1.07 MB │ 273 kB │ 400 kB │
└───────────┴────────┴────────┴─────────┴─────────┴─────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 20

0 2xx responses, 51091 non 2xx responses
52k requests in 20.08s, 21.4 MB read